// ---1---
// Перепишіть функцію, використовуючи '?' або '||'
// function checkAge(age) {
// if (age > 18) {
// return true;
// } else {
// return confirm('Батьки дозволили?');
// }
// }

// --------------------------Solution--------------------------
// function checkAge(age) {
//     return age > 18 ? true : confirm('Батьки дозволили?');
// }

// console.log(checkAge(32));
// console.log(checkAge(12));
// ------------------------------------------------------------


// ---2---
// Напишіть функцію min(a, b), яка повертає менше з двох чисел a та b.

// --------------------------Solution--------------------------
// function min(a, b) {
//     if (a < b) {
//         return a;
//     }
//     return b;
// }

// console.log(min(10, -4));
// console.log(min(5, 5));
// console.log(min(3, 12));
// ------------------------------------------------------------


// ---3---
// Перепишіть з використанням стрілкових функцій
// Замініть Функціональні Вирази на стрілкові функції у коді нижче:

// function ask(question, yes, no) {
// if (confirm(question)) yes();
// else no();
// }
// ask(
// "Ви згодні?"
// ,
// function() { alert("Ви погодились."); },
// function() { alert("Ви скасували виконання."); }
// );

// --------------------------Solution--------------------------
// const ask = (question, yes, no) => {
//     if (confirm(question)) yes();
//     else no();
// }
// ask("Ви згодні",
//     () => alert("Ви погодились."),
//     () => alert("Ви скасували виконання."));
// ------------------------------------------------------------